hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_dac_regs.h
/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_DAC_H
#define HPM_DAC_H

typedef struct {
    __W  uint32_t CFG0;                        /* 0x0:  */
    __RW uint32_t CFG1;                        /* 0x4:  */
    __RW uint32_t CFG2;                        /* 0x8:  */
    __R  uint8_t  RESERVED0[4];                /* 0xC - 0xF: Reserved */
    __RW uint32_t STEP_CFG[4];                 /* 0x10 - 0x1C:  */
    __RW uint32_t BUF_ADDR[2];                 /* 0x20 - 0x24:  */
    __RW uint32_t BUF_LENGTH;                  /* 0x28:  */
    __R  uint8_t  RESERVED1[4];                /* 0x2C - 0x2F: Reserved */
    __W  uint32_t IRQ_STS;                     /* 0x30:  */
    __RW uint32_t IRQ_EN;                      /* 0x34:  */
    __RW uint32_t DMA_EN;                      /* 0x38:  */
    __R  uint8_t  RESERVED2[4];                /* 0x3C - 0x3F: Reserved */
    __RW uint32_t ANA_CFG0;                    /* 0x40:  */
    __RW uint32_t CFG0_BAK;                    /* 0x44:  */
    __RW uint32_t STATUS0;                     /* 0x48:  */
} DAC_Type;


/* Bitfield definition for register: CFG0 */
/*
 * SW_DAC_DATA (WO)
 *
 * dac data used in direct mode(dac_mode==2'b10)
 */
#define DAC_CFG0_SW_DAC_DATA_MASK (0xFFF0000UL)
#define DAC_CFG0_SW_DAC_DATA_SHIFT (16U)
#define DAC_CFG0_SW_DAC_DATA_SET(x) (((uint32_t)(x) << DAC_CFG0_SW_DAC_DATA_SHIFT) & DAC_CFG0_SW_DAC_DATA_MASK)
#define DAC_CFG0_SW_DAC_DATA_GET(x) (((uint32_t)(x) & DAC_CFG0_SW_DAC_DATA_MASK) >> DAC_CFG0_SW_DAC_DATA_SHIFT)

/*
 * DMA_AHB_EN (WO)
 *
 * set to enable internal DMA, it will read one burst if enough space in FIFO.
 * Should only be used in buffer mode.
 */
#define DAC_CFG0_DMA_AHB_EN_MASK (0x200U)
#define DAC_CFG0_DMA_AHB_EN_SHIFT (9U)
#define DAC_CFG0_DMA_AHB_EN_SET(x) (((uint32_t)(x) << DAC_CFG0_DMA_AHB_EN_SHIFT) & DAC_CFG0_DMA_AHB_EN_MASK)
#define DAC_CFG0_DMA_AHB_EN_GET(x) (((uint32_t)(x) & DAC_CFG0_DMA_AHB_EN_MASK) >> DAC_CFG0_DMA_AHB_EN_SHIFT)

/*
 * SYNC_MODE (WO)
 *
 * 1: sync dac clock and ahb clock.
 *   all HW trigger signals are pulse in sync mode, can get faster response;
 * 0: async dac clock and ahb_clock
 *   all HW trigger signals should be level and should be more than one dac clock cycle,  used to get accurate output frequency(which may not be divided from AHB clock)
 */
#define DAC_CFG0_SYNC_MODE_MASK (0x100U)
#define DAC_CFG0_SYNC_MODE_SHIFT (8U)
#define DAC_CFG0_SYNC_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_SYNC_MODE_SHIFT) & DAC_CFG0_SYNC_MODE_MASK)
#define DAC_CFG0_SYNC_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_SYNC_MODE_MASK) >> DAC_CFG0_SYNC_MODE_SHIFT)

/*
 * TRIG_MODE (WO)
 *
 * 0: single mode, one trigger pulse will send one 12bit data to DAC analog;
 * 1: continual mode, if trigger signal(either  or HW) is set, DAC will send data if FIFO is not empty, if trigger signal is clear, DAC will stop send data.
 */
#define DAC_CFG0_TRIG_MODE_MASK (0x80U)
#define DAC_CFG0_TRIG_MODE_SHIFT (7U)
#define DAC_CFG0_TRIG_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_TRIG_MODE_SHIFT) & DAC_CFG0_TRIG_MODE_MASK)
#define DAC_CFG0_TRIG_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_TRIG_MODE_MASK) >> DAC_CFG0_TRIG_MODE_SHIFT)

/*
 * HW_TRIG_EN (WO)
 *
 * set to use trigger signal from trigger_mux, user should config it to pulse in single mode, and level in continual mode
 */
#define DAC_CFG0_HW_TRIG_EN_MASK (0x40U)
#define DAC_CFG0_HW_TRIG_EN_SHIFT (6U)
#define DAC_CFG0_HW_TRIG_EN_SET(x) (((uint32_t)(x) << DAC_CFG0_HW_TRIG_EN_SHIFT) & DAC_CFG0_HW_TRIG_EN_MASK)
#define DAC_CFG0_HW_TRIG_EN_GET(x) (((uint32_t)(x) & DAC_CFG0_HW_TRIG_EN_MASK) >> DAC_CFG0_HW_TRIG_EN_SHIFT)

/*
 * DAC_MODE (WO)
 *
 * 00: direct mode, DAC output the fixed configured data(from sw_dac_data)
 * 01: step mode, DAC output from start_point to end point, with configured step, can step up or step down
 * 10: buffer mode,  read data from buffer, then output to analog, internal DMA will load next burst if enough space in local FIFO;
 */
#define DAC_CFG0_DAC_MODE_MASK (0x30U)
#define DAC_CFG0_DAC_MODE_SHIFT (4U)
#define DAC_CFG0_DAC_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_DAC_MODE_SHIFT) & DAC_CFG0_DAC_MODE_MASK)
#define DAC_CFG0_DAC_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_DAC_MODE_MASK) >> DAC_CFG0_DAC_MODE_SHIFT)

/*
 * BUF_DATA_MODE (WO)
 *
 * data structure for buffer mode,
 * 0: each 32-bit data contains 2 points, b11:0 for first, b27:16 for second.
 * 1: each 32-bit data contains 1 point, b11:0 for first
 */
#define DAC_CFG0_BUF_DATA_MODE_MASK (0x8U)
#define DAC_CFG0_BUF_DATA_MODE_SHIFT (3U)
#define DAC_CFG0_BUF_DATA_MODE_SET(x) (((uint32_t)(x) << DAC_CFG0_BUF_DATA_MODE_SHIFT) & DAC_CFG0_BUF_DATA_MODE_MASK)
#define DAC_CFG0_BUF_DATA_MODE_GET(x) (((uint32_t)(x) & DAC_CFG0_BUF_DATA_MODE_MASK) >> DAC_CFG0_BUF_DATA_MODE_SHIFT)

/*
 * HBURST_CFG (WO)
 *
 * DAC support following fixed burst only
 * 000-SINGLE;  011-INCR4;  101: INCR8
 * others are reserved
 */
#define DAC_CFG0_HBURST_CFG_MASK (0x7U)
#define DAC_CFG0_HBURST_CFG_SHIFT (0U)
#define DAC_CFG0_HBURST_CFG_SET(x) (((uint32_t)(x) << DAC_CFG0_HBURST_CFG_SHIFT) & DAC_CFG0_HBURST_CFG_MASK)
#define DAC_CFG0_HBURST_CFG_GET(x) (((uint32_t)(x) & DAC_CFG0_HBURST_CFG_MASK) >> DAC_CFG0_HBURST_CFG_SHIFT)

/* Bitfield definition for register: CFG1 */
/*
 * ANA_CLK_EN (RW)
 *
 * set to enable analog clock(divided by ana_div_cfg)
 */
#define DAC_CFG1_ANA_CLK_EN_MASK (0x40000UL)
#define DAC_CFG1_ANA_CLK_EN_SHIFT (18U)
#define DAC_CFG1_ANA_CLK_EN_SET(x) (((uint32_t)(x) << DAC_CFG1_ANA_CLK_EN_SHIFT) & DAC_CFG1_ANA_CLK_EN_MASK)
#define DAC_CFG1_ANA_CLK_EN_GET(x) (((uint32_t)(x) & DAC_CFG1_ANA_CLK_EN_MASK) >> DAC_CFG1_ANA_CLK_EN_SHIFT)

/*
 * ANA_DIV_CFG (RW)
 *
 * clock divider config for ana_clk to dac analog;
 * 00:  div2
 * 01:  div4
 * 10:  div6
 * 11:  div8
 */
#define DAC_CFG1_ANA_DIV_CFG_MASK (0x30000UL)
#define DAC_CFG1_ANA_DIV_CFG_SHIFT (16U)
#define DAC_CFG1_ANA_DIV_CFG_SET(x) (((uint32_t)(x) << DAC_CFG1_ANA_DIV_CFG_SHIFT) & DAC_CFG1_ANA_DIV_CFG_MASK)
#define DAC_CFG1_ANA_DIV_CFG_GET(x) (((uint32_t)(x) & DAC_CFG1_ANA_DIV_CFG_MASK) >> DAC_CFG1_ANA_DIV_CFG_SHIFT)

