hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_dac_regs.h
/*
 * BUF_STOP (RW)
 *
 * set to stop read point at end of bufffer0
 */
#define DAC_BUF_ADDR_BUF_STOP_MASK (0x1U)
#define DAC_BUF_ADDR_BUF_STOP_SHIFT (0U)
#define DAC_BUF_ADDR_BUF_STOP_SET(x) (((uint32_t)(x) << DAC_BUF_ADDR_BUF_STOP_SHIFT) & DAC_BUF_ADDR_BUF_STOP_MASK)
#define DAC_BUF_ADDR_BUF_STOP_GET(x) (((uint32_t)(x) & DAC_BUF_ADDR_BUF_STOP_MASK) >> DAC_BUF_ADDR_BUF_STOP_SHIFT)

/* Bitfield definition for register: BUF_LENGTH */
/*
 * BUF1_LEN (RW)
 *
 * buffer length, 1 indicate one 32bit date, 256K-byte max for one buffer
 */
#define DAC_BUF_LENGTH_BUF1_LEN_MASK (0xFFFF0000UL)
#define DAC_BUF_LENGTH_BUF1_LEN_SHIFT (16U)
#define DAC_BUF_LENGTH_BUF1_LEN_SET(x) (((uint32_t)(x) << DAC_BUF_LENGTH_BUF1_LEN_SHIFT) & DAC_BUF_LENGTH_BUF1_LEN_MASK)
#define DAC_BUF_LENGTH_BUF1_LEN_GET(x) (((uint32_t)(x) & DAC_BUF_LENGTH_BUF1_LEN_MASK) >> DAC_BUF_LENGTH_BUF1_LEN_SHIFT)

/*
 * BUF0_LEN (RW)
 *
 */
#define DAC_BUF_LENGTH_BUF0_LEN_MASK (0xFFFFU)
#define DAC_BUF_LENGTH_BUF0_LEN_SHIFT (0U)
#define DAC_BUF_LENGTH_BUF0_LEN_SET(x) (((uint32_t)(x) << DAC_BUF_LENGTH_BUF0_LEN_SHIFT) & DAC_BUF_LENGTH_BUF0_LEN_MASK)
#define DAC_BUF_LENGTH_BUF0_LEN_GET(x) (((uint32_t)(x) & DAC_BUF_LENGTH_BUF0_LEN_MASK) >> DAC_BUF_LENGTH_BUF0_LEN_SHIFT)

/* Bitfield definition for register: IRQ_STS */
/*
 * STEP_CMPT (W1C)
 *
 */
#define DAC_IRQ_STS_STEP_CMPT_MASK (0x10U)
#define DAC_IRQ_STS_STEP_CMPT_SHIFT (4U)
#define DAC_IRQ_STS_STEP_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_STS_STEP_CMPT_SHIFT) & DAC_IRQ_STS_STEP_CMPT_MASK)
#define DAC_IRQ_STS_STEP_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_STS_STEP_CMPT_MASK) >> DAC_IRQ_STS_STEP_CMPT_SHIFT)

/*
 * AHB_ERROR (W1C)
 *
 * set if hresp==2'b01(ERROR)
 */
#define DAC_IRQ_STS_AHB_ERROR_MASK (0x8U)
#define DAC_IRQ_STS_AHB_ERROR_SHIFT (3U)
#define DAC_IRQ_STS_AHB_ERROR_SET(x) (((uint32_t)(x) << DAC_IRQ_STS_AHB_ERROR_SHIFT) & DAC_IRQ_STS_AHB_ERROR_MASK)
#define DAC_IRQ_STS_AHB_ERROR_GET(x) (((uint32_t)(x) & DAC_IRQ_STS_AHB_ERROR_MASK) >> DAC_IRQ_STS_AHB_ERROR_SHIFT)

/*
 * FIFO_EMPTY (W1C)
 *
 */
#define DAC_IRQ_STS_FIFO_EMPTY_MASK (0x4U)
#define DAC_IRQ_STS_FIFO_EMPTY_SHIFT (2U)
#define DAC_IRQ_STS_FIFO_EMPTY_SET(x) (((uint32_t)(x) << DAC_IRQ_STS_FIFO_EMPTY_SHIFT) & DAC_IRQ_STS_FIFO_EMPTY_MASK)
#define DAC_IRQ_STS_FIFO_EMPTY_GET(x) (((uint32_t)(x) & DAC_IRQ_STS_FIFO_EMPTY_MASK) >> DAC_IRQ_STS_FIFO_EMPTY_SHIFT)

/*
 * BUF1_CMPT (W1C)
 *
 */
#define DAC_IRQ_STS_BUF1_CMPT_MASK (0x2U)
#define DAC_IRQ_STS_BUF1_CMPT_SHIFT (1U)
#define DAC_IRQ_STS_BUF1_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_STS_BUF1_CMPT_SHIFT) & DAC_IRQ_STS_BUF1_CMPT_MASK)
#define DAC_IRQ_STS_BUF1_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_STS_BUF1_CMPT_MASK) >> DAC_IRQ_STS_BUF1_CMPT_SHIFT)

/*
 * BUF0_CMPT (W1C)
 *
 */
#define DAC_IRQ_STS_BUF0_CMPT_MASK (0x1U)
#define DAC_IRQ_STS_BUF0_CMPT_SHIFT (0U)
#define DAC_IRQ_STS_BUF0_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_STS_BUF0_CMPT_SHIFT) & DAC_IRQ_STS_BUF0_CMPT_MASK)
#define DAC_IRQ_STS_BUF0_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_STS_BUF0_CMPT_MASK) >> DAC_IRQ_STS_BUF0_CMPT_SHIFT)

/* Bitfield definition for register: IRQ_EN */
/*
 * STEP_CMPT (RW)
 *
 */
#define DAC_IRQ_EN_STEP_CMPT_MASK (0x10U)
#define DAC_IRQ_EN_STEP_CMPT_SHIFT (4U)
#define DAC_IRQ_EN_STEP_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_EN_STEP_CMPT_SHIFT) & DAC_IRQ_EN_STEP_CMPT_MASK)
#define DAC_IRQ_EN_STEP_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_EN_STEP_CMPT_MASK) >> DAC_IRQ_EN_STEP_CMPT_SHIFT)

/*
 * AHB_ERROR (RW)
 *
 */
#define DAC_IRQ_EN_AHB_ERROR_MASK (0x8U)
#define DAC_IRQ_EN_AHB_ERROR_SHIFT (3U)
#define DAC_IRQ_EN_AHB_ERROR_SET(x) (((uint32_t)(x) << DAC_IRQ_EN_AHB_ERROR_SHIFT) & DAC_IRQ_EN_AHB_ERROR_MASK)
#define DAC_IRQ_EN_AHB_ERROR_GET(x) (((uint32_t)(x) & DAC_IRQ_EN_AHB_ERROR_MASK) >> DAC_IRQ_EN_AHB_ERROR_SHIFT)

/*
 * FIFO_EMPTY (RW)
 *
 */
#define DAC_IRQ_EN_FIFO_EMPTY_MASK (0x4U)
#define DAC_IRQ_EN_FIFO_EMPTY_SHIFT (2U)
#define DAC_IRQ_EN_FIFO_EMPTY_SET(x) (((uint32_t)(x) << DAC_IRQ_EN_FIFO_EMPTY_SHIFT) & DAC_IRQ_EN_FIFO_EMPTY_MASK)
#define DAC_IRQ_EN_FIFO_EMPTY_GET(x) (((uint32_t)(x) & DAC_IRQ_EN_FIFO_EMPTY_MASK) >> DAC_IRQ_EN_FIFO_EMPTY_SHIFT)

/*
 * BUF1_CMPT (RW)
 *
 */
#define DAC_IRQ_EN_BUF1_CMPT_MASK (0x2U)
#define DAC_IRQ_EN_BUF1_CMPT_SHIFT (1U)
#define DAC_IRQ_EN_BUF1_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_EN_BUF1_CMPT_SHIFT) & DAC_IRQ_EN_BUF1_CMPT_MASK)
#define DAC_IRQ_EN_BUF1_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_EN_BUF1_CMPT_MASK) >> DAC_IRQ_EN_BUF1_CMPT_SHIFT)

/*
 * BUF0_CMPT (RW)
 *
 */
#define DAC_IRQ_EN_BUF0_CMPT_MASK (0x1U)
#define DAC_IRQ_EN_BUF0_CMPT_SHIFT (0U)
#define DAC_IRQ_EN_BUF0_CMPT_SET(x) (((uint32_t)(x) << DAC_IRQ_EN_BUF0_CMPT_SHIFT) & DAC_IRQ_EN_BUF0_CMPT_MASK)
#define DAC_IRQ_EN_BUF0_CMPT_GET(x) (((uint32_t)(x) & DAC_IRQ_EN_BUF0_CMPT_MASK) >> DAC_IRQ_EN_BUF0_CMPT_SHIFT)

/* Bitfield definition for register: DMA_EN */
/*
 * STEP_CMPT (RW)
 *
 */
#define DAC_DMA_EN_STEP_CMPT_MASK (0x10U)
#define DAC_DMA_EN_STEP_CMPT_SHIFT (4U)
#define DAC_DMA_EN_STEP_CMPT_SET(x) (((uint32_t)(x) << DAC_DMA_EN_STEP_CMPT_SHIFT) & DAC_DMA_EN_STEP_CMPT_MASK)
#define DAC_DMA_EN_STEP_CMPT_GET(x) (((uint32_t)(x) & DAC_DMA_EN_STEP_CMPT_MASK) >> DAC_DMA_EN_STEP_CMPT_SHIFT)

/*
 * BUF1_CMPT (RW)
 *
 */
#define DAC_DMA_EN_BUF1_CMPT_MASK (0x2U)
#define DAC_DMA_EN_BUF1_CMPT_SHIFT (1U)
#define DAC_DMA_EN_BUF1_CMPT_SET(x) (((uint32_t)(x) << DAC_DMA_EN_BUF1_CMPT_SHIFT) & DAC_DMA_EN_BUF1_CMPT_MASK)
#define DAC_DMA_EN_BUF1_CMPT_GET(x) (((uint32_t)(x) & DAC_DMA_EN_BUF1_CMPT_MASK) >> DAC_DMA_EN_BUF1_CMPT_SHIFT)

/*
 * BUF0_CMPT (RW)
 *
 */
#define DAC_DMA_EN_BUF0_CMPT_MASK (0x1U)
#define DAC_DMA_EN_BUF0_CMPT_SHIFT (0U)
#define DAC_DMA_EN_BUF0_CMPT_SET(x) (((uint32_t)(x) << DAC_DMA_EN_BUF0_CMPT_SHIFT) & DAC_DMA_EN_BUF0_CMPT_MASK)
#define DAC_DMA_EN_BUF0_CMPT_GET(x) (((uint32_t)(x) & DAC_DMA_EN_BUF0_CMPT_MASK) >> DAC_DMA_EN_BUF0_CMPT_SHIFT)

/* Bitfield definition for register: ANA_CFG0 */
/*
 * DAC12BIT_LP_MODE (RW)
 *
 */
#define DAC_ANA_CFG0_DAC12BIT_LP_MODE_MASK (0x100U)
#define DAC_ANA_CFG0_DAC12BIT_LP_MODE_SHIFT (8U)
#define DAC_ANA_CFG0_DAC12BIT_LP_MODE_SET(x) (((uint32_t)(x) << DAC_ANA_CFG0_DAC12BIT_LP_MODE_SHIFT) & DAC_ANA_CFG0_DAC12BIT_LP_MODE_MASK)
#define DAC_ANA_CFG0_DAC12BIT_LP_MODE_GET(x) (((uint32_t)(x) & DAC_ANA_CFG0_DAC12BIT_LP_MODE_MASK) >> DAC_ANA_CFG0_DAC12BIT_LP_MODE_SHIFT)

